balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/18xxxx/PIC18LF26J53.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMDIS0" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMDIS0" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PD0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCMD" edc:desc="" edc:mask="0x1" edc:name="ADCMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPI1MD" edc:desc="" edc:mask="0x1" edc:name="SPI1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPI2MD" edc:desc="" edc:mask="0x1" edc:name="SPI2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UART1MD" edc:desc="" edc:mask="0x1" edc:name="UART1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UART2MD" edc:desc="" edc:mask="0x1" edc:name="UART2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ECCP1MD" edc:desc="" edc:mask="0x1" edc:name="ECCP1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ECCP2MD" edc:desc="" edc:mask="0x1" edc:name="ECCP2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ECCP3MD" edc:desc="" edc:mask="0x1" edc:name="ECCP3MD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PMDMSSP1" edc:desc="" edc:mask="0x1" edc:name="PMDMSSP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDMSSP2" edc:desc="" edc:mask="0x1" edc:name="PMDMSSP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDUART1" edc:desc="" edc:mask="0x1" edc:name="PMDUART1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDUART2" edc:desc="" edc:mask="0x1" edc:name="PMDUART2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDECCP1" edc:desc="" edc:mask="0x1" edc:name="PMDECCP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDECCP2" edc:desc="" edc:mask="0x1" edc:name="PMDECCP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDECCP3" edc:desc="" edc:mask="0x1" edc:name="PMDECCP3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PMDADC" edc:desc="" edc:mask="0x1" edc:name="PMDADC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDMSSP" edc:desc="" edc:mask="0x3" edc:name="PMDMSSP" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PMDUART" edc:desc="" edc:mask="0x3" edc:name="PMDUART" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PMDECCP" edc:desc="" edc:mask="0x7" edc:name="PMDECCP" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SPIMD" edc:desc="" edc:mask="0x3" edc:name="SPIMD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="UARTMD" edc:desc="" edc:mask="0x3" edc:name="UARTMD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ECCPMD" edc:desc="" edc:mask="0x7" edc:name="ECCPMD" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnn-" edc:cname="PMDIS1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000-" edc:name="PMDIS1" edc:nzwidth="8" edc:por="-000000-">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PD1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TMR1MD" edc:desc="" edc:mask="0x1" edc:name="TMR1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR2MD" edc:desc="" edc:mask="0x1" edc:name="TMR2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3MD" edc:desc="" edc:mask="0x1" edc:name="TMR3MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR4MD" edc:desc="" edc:mask="0x1" edc:name="TMR4MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTCCMD" edc:desc="" edc:mask="0x1" edc:name="RTCCMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMUMD" edc:desc="" edc:mask="0x1" edc:name="CTMUMD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PMDTMR1" edc:desc="" edc:mask="0x1" edc:name="PMDTMR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDTMR2" edc:desc="" edc:mask="0x1" edc:name="PMDTMR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDTMR3" edc:desc="" edc:mask="0x1" edc:name="PMDTMR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDTMR4" edc:desc="" edc:mask="0x1" edc:name="PMDTMR4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PMDTMR" edc:desc="" edc:mask="0xf" edc:name="PMDTMR" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="PMDRTCC" edc:desc="" edc:mask="0x1" edc:name="PMDRTCC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDCTMU" edc:desc="" edc:mask="0x1" edc:name="PMDCTMU" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TMRMD" edc:desc="" edc:mask="0xf" edc:name="TMRMD" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-n-nnnnn" edc:cname="PMDIS2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0-00000" edc:name="PMDIS2" edc:nzwidth="8" edc:por="-0-00000">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PD2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CMP1MD" edc:desc="" edc:mask="0x1" edc:name="CMP1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMP2MD" edc:desc="" edc:mask="0x1" edc:name="CMP2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMP3MD" edc:desc="" edc:mask="0x1" edc:name="CMP3MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR5MD" edc:desc="" edc:mask="0x1" edc:name="TMR5MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR6MD" edc:desc="" edc:mask="0x1" edc:name="TMR6MD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TMR8MD" edc:desc="" edc:mask="0x1" edc:name="TMR8MD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PMDCMP1" edc:desc="" edc:mask="0x1" edc:name="PMDCMP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDCMP2" edc:desc="" edc:mask="0x1" edc:name="PMDCMP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDCMP3" edc:desc="" edc:mask="0x1" edc:name="PMDCMP3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PMDCMP" edc:desc="" edc:mask="0x7" edc:name="PMDCMP" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="PMDTMR5" edc:desc="" edc:mask="0x1" edc:name="PMDTMR5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDTMR6" edc:desc="" edc:mask="0x1" edc:name="PMDTMR6" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PMDTMR8" edc:desc="" edc:mask="0x1" edc:name="PMDTMR8" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CMPMD" edc:desc="" edc:mask="0x7" edc:name="CMPMD" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
